[Rainmeter]
Update=1000
AccurateText=1
DynamicWindowSize=1
defaultwindowX=200
defaultwindowY=80
defaultdraggable=1
defaultalwaysontop=0

[Metadata]
Name=chinese-seal
Author=chenxing
Information=A Chinese themed Rainmeter widget for Windows desktop
Version=1.0.0
License=Creative Commons Attribution - Non - Commercial - Share Alike 3.0

[Variables]

[home]
meter=button
ButtonImage=#@#images/home.png
x=1
leftMouseUpAction=["Shell:MyComputerFolder"]
ToolTipText=我的電腦

[gh]
meter=button
ButtonImage=#@#images/gh.png
x=0
y=181
ToolTipText=GitHub
leftMouseUpAction=["https://www.github.com"]

[shutdown]
meter=button
ButtonImage=#@#images/shutdown.png
x=0
y=270
ToolTipText=關機
leftMouseUpAction=["#@#nircmd.exe" exitwin shutdown]

[reboot]
meter=button
ButtonImage=#@#images/reboot.png
x=220
y=0
ToolTipText=重啓
leftMouseUpAction=["#@#nircmd.exe" exitwin reboot]